'use client'
import Link from "next/link"
import { FormEvent } from "react";
import emailjs from '@emailjs/browser';
import { toast } from "react-toastify";
const Footer = () => {

    const handleSubmit = async (e: FormEvent<HTMLFormElement>) => {
        e.preventDefault();
        const formData = new FormData(e.currentTarget);
        const fullName = formData.get('fullName');
        const phone = formData.get('phone') || '';
        const email = formData.get('email') || '';

        if (fullName === '' || (email === '' && phone === '')) {
            toast.warning("Không được để trống. Vui lòng nhập đủ thông tin");
            return;
        }

        const phoneNumberPattern = /^\(?(\d{3})\)?[- ]?(\d{3})[- ]?(\d{4})$/;
        if (phone !== '' && !phoneNumberPattern.test(phone as string)) {
            toast.warning("Số điện thoại của bạn chưa đúng. Vui lòng nhập lại");
            return;
        }

        try {
            const response = await fetch("https://formspree.io/f/xnndkeja", {
                method: "POST",
                headers: {
                    "Content-Type": "application/json"
                },
                body: JSON.stringify({
                    fullName,
                    phone,
                    email
                })
            });

            if (response.ok) {
                toast.success("Cám ơn bạn đã để lại thông tin. Chúng tôi sẽ sớm liên hệ với bạn");
                //@ts-ignore
                e.target.reset && e.target.reset();
            } else {
                toast.warning("Gửi không thành công. Vui lòng thử lại sau.");
            }
        } catch (error) {
            toast.error("Lỗi khi gửi dữ liệu.");
        }
    };

    const handleToTop = () => {
        window.scrollTo({ top: 0, behavior: 'smooth' })
    }
    return (
        <div className="relative bg-cover bg-center w-full h-screen" style={{ backgroundColor: '#091635', backgroundImage: `url(/images/pages/footer/footer.png)` }}>
            <div className="absolute md:p-8 lg:p-28 top-0 left-0 bottom-0 w-full bg-opacity-30 content-center bg-[#091635]">
                <div className="grid grid-cols-12 col w-full max-w-screen-xl mx-auto">
                    <div className={`col-span-12 md:col-span-8 bg-[#0a3252]  p-10`}>
                        <div className="my-10">
                            <img src="/images/logos/logo.png" width={300} alt="logo alana city" />
                        </div>
                        <div className="col-span-12 md:col-span-4 grid grid-cols-12  gap-4">
                            <div className="col-span-12 md:col-span-6 text-left">
                                <hr className="h-0.5 my-4 mr-10 border-t-0 bg-[#e2ac8a]" />
                                <h2 className="text-xl text-[#e2ac8a]">ĐỊA CHỈ DỰ ÁN</h2>
                                <h3 className="text-sm mt-2 text-[#f1d6c4]">ĐT741, Phước Hoà, Phú Giáo, Bình Dương</h3>
                            </div>
                            <div className="col-span-12 md:col-span-6 text-left">
                                <hr className="h-0.5 my-4 mr-10 border-t-0 bg-[#e2ac8a]" />
                                <h2 className="text-2xl text-[#e2ac8a]">LIÊN HỆ</h2>
                                <div className="grid grid-cols-12 gap-2">
                                    <div className="col-span-3 font-bold text-sm text-[#f1d6c4]">
                                        <p>Hotline</p>
                                        <p>Email</p>
                                        <p>Website</p>
                                    </div>
                                    <div className="col-span-9 lg:col-span-6 text-sm text-[#f1d6c4]">
                                        <a className="block" href="tel:0987050318">0987.050.318</a>
                                        <a className="block" href="mail:infomaxreal@gmail.com">infomaxreal@gmail.com</a>
                                        <p>alana-city.vn</p>
                                    </div>
                                    <div className="col-span-12 mt-2 justify-items-end flex gap-2">
                                        <a className="" href="https://zalo.me/1995643211255654551" target="_blank">
                                            <svg width="30px" height="30px" viewBox="0 0 50 50">
                                                <path fill="#f1d6c4" d="M 9 4 C 6.2504839 4 4 6.2504839 4 9 L 4 41 C 4 43.749516 6.2504839 46 9 46 L 41 46 C 43.749516 46 46 43.749516 46 41 L 46 9 C 46 6.2504839 43.749516 4 41 4 L 9 4 z M 9 6 L 15.580078 6 C 12.00899 9.7156859 10 14.518083 10 19.5 C 10 24.66 12.110156 29.599844 15.910156 33.339844 C 16.030156 33.549844 16.129922 34.579531 15.669922 35.769531 C 15.379922 36.519531 14.799687 37.499141 13.679688 37.869141 C 13.249688 38.009141 12.97 38.430859 13 38.880859 C 13.03 39.330859 13.360781 39.710781 13.800781 39.800781 C 16.670781 40.370781 18.529297 39.510078 20.029297 38.830078 C 21.379297 38.210078 22.270625 37.789609 23.640625 38.349609 C 26.440625 39.439609 29.42 40 32.5 40 C 36.593685 40 40.531459 39.000731 44 37.113281 L 44 41 C 44 42.668484 42.668484 44 41 44 L 9 44 C 7.3315161 44 6 42.668484 6 41 L 6 9 C 6 7.3315161 7.3315161 6 9 6 z M 33 15 C 33.55 15 34 15.45 34 16 L 34 25 C 34 25.55 33.55 26 33 26 C 32.45 26 32 25.55 32 25 L 32 16 C 32 15.45 32.45 15 33 15 z M 18 16 L 23 16 C 23.36 16 23.700859 16.199531 23.880859 16.519531 C 24.050859 16.829531 24.039609 17.219297 23.849609 17.529297 L 19.800781 24 L 23 24 C 23.55 24 24 24.45 24 25 C 24 25.55 23.55 26 23 26 L 18 26 C 17.64 26 17.299141 25.800469 17.119141 25.480469 C 16.949141 25.170469 16.960391 24.780703 17.150391 24.470703 L 21.199219 18 L 18 18 C 17.45 18 17 17.55 17 17 C 17 16.45 17.45 16 18 16 z M 27.5 19 C 28.11 19 28.679453 19.169219 29.189453 19.449219 C 29.369453 19.189219 29.65 19 30 19 C 30.55 19 31 19.45 31 20 L 31 25 C 31 25.55 30.55 26 30 26 C 29.65 26 29.369453 25.810781 29.189453 25.550781 C 28.679453 25.830781 28.11 26 27.5 26 C 25.57 26 24 24.43 24 22.5 C 24 20.57 25.57 19 27.5 19 z M 38.5 19 C 40.43 19 42 20.57 42 22.5 C 42 24.43 40.43 26 38.5 26 C 36.57 26 35 24.43 35 22.5 C 35 20.57 36.57 19 38.5 19 z M 27.5 21 C 27.39625 21 27.29502 21.011309 27.197266 21.03125 C 27.001758 21.071133 26.819727 21.148164 26.660156 21.255859 C 26.500586 21.363555 26.363555 21.500586 26.255859 21.660156 C 26.148164 21.819727 26.071133 22.001758 26.03125 22.197266 C 26.011309 22.29502 26 22.39625 26 22.5 C 26 22.60375 26.011309 22.70498 26.03125 22.802734 C 26.051191 22.900488 26.079297 22.994219 26.117188 23.083984 C 26.155078 23.17375 26.202012 23.260059 26.255859 23.339844 C 26.309707 23.419629 26.371641 23.492734 26.439453 23.560547 C 26.507266 23.628359 26.580371 23.690293 26.660156 23.744141 C 26.819727 23.851836 27.001758 23.928867 27.197266 23.96875 C 27.29502 23.988691 27.39625 24 27.5 24 C 27.60375 24 27.70498 23.988691 27.802734 23.96875 C 28.487012 23.82916 29 23.22625 29 22.5 C 29 21.67 28.33 21 27.5 21 z M 38.5 21 C 38.39625 21 38.29502 21.011309 38.197266 21.03125 C 38.099512 21.051191 38.005781 21.079297 37.916016 21.117188 C 37.82625 21.155078 37.739941 21.202012 37.660156 21.255859 C 37.580371 21.309707 37.507266 21.371641 37.439453 21.439453 C 37.303828 21.575078 37.192969 21.736484 37.117188 21.916016 C 37.079297 22.005781 37.051191 22.099512 37.03125 22.197266 C 37.011309 22.29502 37 22.39625 37 22.5 C 37 22.60375 37.011309 22.70498 37.03125 22.802734 C 37.051191 22.900488 37.079297 22.994219 37.117188 23.083984 C 37.155078 23.17375 37.202012 23.260059 37.255859 23.339844 C 37.309707 23.419629 37.371641 23.492734 37.439453 23.560547 C 37.507266 23.628359 37.580371 23.690293 37.660156 23.744141 C 37.739941 23.797988 37.82625 23.844922 37.916016 23.882812 C 38.005781 23.920703 38.099512 23.948809 38.197266 23.96875 C 38.29502 23.988691 38.39625 24 38.5 24 C 38.60375 24 38.70498 23.988691 38.802734 23.96875 C 39.487012 23.82916 40 23.22625 40 22.5 C 40 21.67 39.33 21 38.5 21 z" />
                                            </svg>
                                        </a>
                                        <a className="" href="https://www.facebook.com/maxreal.com.vn" target="_blank">
                                            <svg fill="#f1d6c4" width="30px" height="30px" viewBox="0 0 32 32" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M32 16c0-8.839-7.167-16-16-16-8.839 0-16 7.161-16 16 0 7.984 5.849 14.604 13.5 15.803v-11.177h-4.063v-4.625h4.063v-3.527c0-4.009 2.385-6.223 6.041-6.223 1.751 0 3.584 0.312 3.584 0.312v3.937h-2.021c-1.984 0-2.604 1.235-2.604 2.5v3h4.437l-0.713 4.625h-3.724v11.177c7.645-1.199 13.5-7.819 13.5-15.803z" />
                                            </svg>
                                        </a>
                                        <a className="" href="https://www.youtube.com/@bdsmaxreal" target="_blank">
                                            <svg fill="#f1d6c4" height="30px" width="30px" xmlns="http://www.w3.org/2000/svg" viewBox="-143 145 512 512">
                                                <g>
                                                    <polygon points="78.9,450.3 162.7,401.1 78.9,351.9 	" />
                                                    <path d="M113,145c-141.4,0-256,114.6-256,256s114.6,256,256,256s256-114.6,256-256S254.4,145,113,145z M241,446.8L241,446.8
		c0,44.1-44.1,44.1-44.1,44.1H29.1c-44.1,0-44.1-44.1-44.1-44.1v-91.5c0-44.1,44.1-44.1,44.1-44.1h167.8c44.1,0,44.1,44.1,44.1,44.1
		V446.8z"/>

                                                </g>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                            </div>
                        </div>
                        <div className="col-span-12 flex my-4">
                            <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d4458.8850275071845!2d106.72135159999999!3d11.2151942!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x3174c935fe80976d%3A0xbc80a55b89ea14ad!2zS2h1IMSRw7QgdGjhu4sgQWxhbmEgQ2l0eQ!5e1!3m2!1svi!2s!4v1727681735172!5m2!1svi!2s"
                                width="100%" height="220" allowFullScreen loading="lazy" referrerPolicy="no-referrer-when-downgrade"></iframe>
                        </div>
                    </div>
                    <form onSubmit={handleSubmit} className="col-span-12 md:col-span-4 bg-[#e2ac8a] text-[#0a3252] p-8">
                        <h3 className="text-xl text-center font-bold mt-8">TÌM HIỂU THÊM VỀ DỰ ÁN</h3>
                        <p className="text-sm mt-4">Quý khách vui lòng để lại thông tin theo mẫu bên dưới để chúng tôi có thể hỗ trợ tốt hơn các thông tin về dự án.</p>
                        <div className="bg-[#f1d6c4] rounded-lg p-4 mt-4 text-[#e2ac8a] ">
                            <input type="text" name="fullName" className="w-full mt-4 bg-[#f1d6c4] border-b-2 border-[#e2ac8a] text-black placeholder:text-[#e2ac8a] focus:outline-none" placeholder="Họ và tên" />
                            <input type="tel" name="phone" className="w-full  mt-4 bg-[#f1d6c4] border-b-2 border-[#e2ac8a] text-black placeholder:text-[#e2ac8a] focus:outline-none" placeholder="Số điện thoại" />
                            <input type="email" name="email" className="w-full  mt-4 bg-[#f1d6c4] border-b-2 border-[#e2ac8a] text-black placeholder:text-[#e2ac8a] focus:outline-none" placeholder="Email" />
                            <div className="w-full items-center text-center">
                                <button type="submit" className="bg-[#0a3252] rounded-lg px-10 py-0.5 mx-auto mt-8 " >Gửi</button>
                            </div>
                        </div>
                    </form>
                </div>
            </div>
            <div className="fixed right-1 bottom-5 md:right-5 md:bottom-12 z-[8999]">

                <div onClick={handleToTop} className="block h-6 w-6 md:h-10 md:w-10 ml-2 rounded-full bg-[#f0d6c4] content-center text-center pl-1 md:pl-2">
                    <svg fill="#91473a" height="80%" width="80%" viewBox="0 0 330 330">
                        <path d="M325.606,229.393l-150.004-150C172.79,76.58,168.974,75,164.996,75c-3.979,0-7.794,1.581-10.607,4.394  l-149.996,150c-5.858,5.858-5.858,15.355,0,21.213c5.857,5.857,15.355,5.858,21.213,0l139.39-139.393l139.397,139.393  C307.322,253.536,311.161,255,315,255c3.839,0,7.678-1.464,10.607-4.394C331.464,244.748,331.464,235.251,325.606,229.393z" />
                    </svg>
                </div>
                <Link className="block h-12 w-12 md:h-16 md:w-16 rounded-full bg-[#f0d6c4] content-center text-center p-2 mt-6 -ml-1 pulse" href="https://360vr.com.vn/projects/alana-city/" target="_blank">
                    <svg xmlns="http://www.w3.org/2000/svg" fill="#91473a" version="1.1" viewBox="0 0 480 480" >
                        <g>
                            <g>
                                <g>
                                    <path d="M391.502,210.725c-5.311-1.52-10.846,1.555-12.364,6.865c-1.519,5.31,1.555,10.846,6.864,12.364     C431.646,243.008,460,261.942,460,279.367c0,12.752-15.51,26.749-42.552,38.402c-29.752,12.82-71.958,22.2-118.891,26.425     l-40.963-0.555c-0.047,0-0.093-0.001-0.139-0.001c-5.46,0-9.922,4.389-9.996,9.865c-0.075,5.522,4.342,10.06,9.863,10.134     l41.479,0.562c0.046,0,0.091,0.001,0.136,0.001c0.297,0,0.593-0.013,0.888-0.039c49.196-4.386,93.779-14.339,125.538-28.024     C470.521,316.676,480,294.524,480,279.367C480,251.424,448.57,227.046,391.502,210.725z" />
                                    <path d="M96.879,199.333c-5.522,0-10,4.477-10,10c0,5.523,4.478,10,10,10H138v41.333H96.879c-5.522,0-10,4.477-10,10     s4.478,10,10,10H148c5.523,0,10-4.477,10-10V148c0-5.523-4.477-10-10-10H96.879c-5.522,0-10,4.477-10,10s4.478,10,10,10H138     v41.333H96.879z" />
                                    <path d="M188.879,280.667h61.334c5.522,0,10-4.477,10-10v-61.333c0-5.523-4.477-10-10-10h-51.334V158H240c5.523,0,10-4.477,10-10     s-4.477-10-10-10h-51.121c-5.523,0-10,4.477-10,10v122.667C178.879,276.19,183.356,280.667,188.879,280.667z M198.879,219.333     h41.334v41.333h-41.334V219.333z" />
                                    <path d="M291.121,280.667h61.334c5.522,0,10-4.477,10-10V148c0-5.523-4.478-10-10-10h-61.334c-5.522,0-10,4.477-10,10v122.667     C281.121,276.19,285.599,280.667,291.121,280.667z M301.121,158h41.334v102.667h-41.334V158z" />
                                    <path d="M182.857,305.537c-3.567-4.216-9.877-4.743-14.093-1.176c-4.217,3.567-4.743,9.876-1.177,14.093l22.366,26.44     c-47.196-3.599-89.941-12.249-121.37-24.65C37.708,308.06,20,293.162,20,279.367c0-16.018,23.736-33.28,63.493-46.176     c5.254-1.704,8.131-7.344,6.427-12.598c-1.703-5.253-7.345-8.13-12.597-6.427c-23.129,7.502-41.47,16.427-54.515,26.526     C7.674,252.412,0,265.423,0,279.367c0,23.104,21.178,43.671,61.242,59.48c32.564,12.849,76.227,21.869,124.226,25.758     l-19.944,22.104c-3.7,4.1-3.376,10.424,0.725,14.123c1.912,1.726,4.308,2.576,6.696,2.576c2.731,0,5.453-1.113,7.427-3.301     l36.387-40.325c1.658-1.837,2.576-4.224,2.576-6.699v-0.764c0-2.365-0.838-4.653-2.365-6.458L182.857,305.537z" />
                                    <path d="M381.414,137.486h40.879c5.522,0,10-4.477,10-10V86.592c0-5.523-4.478-10-10-10h-40.879c-5.522,0-10,4.477-10,10v40.894     C371.414,133.009,375.892,137.486,381.414,137.486z M391.414,96.592h20.879v20.894h-20.879V96.592z" />
                                </g>
                            </g>
                        </g>
                    </svg>
                </Link>
                <Link href="tel:0987050318" className="block h-10 w-10 md:h-14 md:w-14 rounded-full bg-[#f0d6c4] content-center text-center p-2 mt-6">
                    <svg viewBox="0 0 24 24" fill="#91473a">
                        <path d="M16.5562 12.9062L16.1007 13.359C16.1007 13.359 15.0181 14.4355 12.0631 11.4972C9.10812 8.55901 10.1907 7.48257 10.1907 7.48257L10.4775 7.19738C11.1841 6.49484 11.2507 5.36691 10.6342 4.54348L9.37326 2.85908C8.61028 1.83992 7.13596 1.70529 6.26145 2.57483L4.69185 4.13552C4.25823 4.56668 3.96765 5.12559 4.00289 5.74561C4.09304 7.33182 4.81071 10.7447 8.81536 14.7266C13.0621 18.9492 17.0468 19.117 18.6763 18.9651C19.1917 18.9171 19.6399 18.6546 20.0011 18.2954L21.4217 16.883C22.3806 15.9295 22.1102 14.2949 20.8833 13.628L18.9728 12.5894C18.1672 12.1515 17.1858 12.2801 16.5562 12.9062Z" />
                    </svg>
                </Link>
                <Link href="https://zalo.me/1995643211255654551" target="_blank" className="block h-10 w-10 md:h-14 md:w-14 rounded-full bg-[#f0d6c4] content-center text-center p-2 mt-2">
                    <svg viewBox="0 0 48 48">
                        <path fill="#2962ff" d="M15,36V6.827l-1.211-0.811C8.64,8.083,5,13.112,5,19v10c0,7.732,6.268,14,14,14h10 c4.722,0,8.883-2.348,11.417-5.931V36H15z" />
                        <path fill="#eee" d="M29,5H19c-1.845,0-3.601,0.366-5.214,1.014C10.453,9.25,8,14.528,8,19 c0,6.771,0.936,10.735,3.712,14.607c0.216,0.301,0.357,0.653,0.376,1.022c0.043,0.835-0.129,2.365-1.634,3.742 c-0.162,0.148-0.059,0.419,0.16,0.428c0.942,0.041,2.843-0.014,4.797-0.877c0.557-0.246,1.191-0.203,1.729,0.083 C20.453,39.764,24.333,40,28,40c4.676,0,9.339-1.04,12.417-2.916C42.038,34.799,43,32.014,43,29V19C43,11.268,36.732,5,29,5z" />
                        <path fill="#2962ff" d="M36.75,27C34.683,27,33,25.317,33,23.25s1.683-3.75,3.75-3.75s3.75,1.683,3.75,3.75 S38.817,27,36.75,27z M36.75,21c-1.24,0-2.25,1.01-2.25,2.25s1.01,2.25,2.25,2.25S39,24.49,39,23.25S37.99,21,36.75,21z" />
                        <path fill="#2962ff" d="M31.5,27h-1c-0.276,0-0.5-0.224-0.5-0.5V18h1.5V27z" />
                        <path fill="#2962ff" d="M27,19.75v0.519c-0.629-0.476-1.403-0.769-2.25-0.769c-2.067,0-3.75,1.683-3.75,3.75 S22.683,27,24.75,27c0.847,0,1.621-0.293,2.25-0.769V26.5c0,0.276,0.224,0.5,0.5,0.5h1v-7.25H27z M24.75,25.5 c-1.24,0-2.25-1.01-2.25-2.25S23.51,21,24.75,21S27,22.01,27,23.25S25.99,25.5,24.75,25.5z" />
                        <path fill="#2962ff" d="M21.25,18h-8v1.5h5.321L13,26h0.026c-0.163,0.211-0.276,0.463-0.276,0.75V27h7.5 c0.276,0,0.5-0.224,0.5-0.5v-1h-5.321L21,19h-0.026c0.163-0.211,0.276-0.463,0.276-0.75V18z" />
                    </svg>
                </Link>
            </div>
        </div>
    )
}
export default Footer
